HELYXcore-4.4.0/examples/legacy/incompressible/overPimpleDyMFoam/simpleRotor/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 200;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(walls|hole)"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

//    left1
//    {
//        type            turbulentMixingLengthDissipationRateInlet;
//        mixingLength    0.01;       // 1cm - half channel height
//        value           $internalField;
//    }
//
//    right1
//    {
//        type            calculated;
//        value           $internalField;
//    }

    overset
    {
        type            overset;
    }
}

// ************************************************************************* //
