HELYXcore-4.4.0/examples/legacy/incompressible/overPimpleDyMFoam/simpleRotor/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.2;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(walls|hole)"
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

//    left1
//    {
//        type            turbulentIntensityKineticEnergyInlet;
//        intensity       0.05;       // 5% turbulent intensity
//        value           $internalField;
//    }
//
//    right1
//    {
//        type            calculated;
//        value           $internalField;
//    }

    overset
    {
        type            overset;
    }
}

// ************************************************************************* //
