HELYXcore-4.4.0/examples/legacy/incompressible/overPimpleDyMFoam/simpleRotor/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(walls|hole)"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

//    left1
//    {
//        type            calculated;
//        value           uniform 0;
//    }
//
//    right1
//    {
//        type            calculated;
//        value           uniform 0;
//    }

    overset
    {
        type            overset;
    }
}

// ************************************************************************* //
