HELYXcore-4.4.0/examples/legacy/incompressible/overPimpleDyMFoam/simpleRotor/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ".*"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    overset
    {
        patchType       overset;
        type            zeroGradient;
    }

    hole
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
